# !/usr/bin/python
# -*- coding: utf-8 -*-

# @Time: 2020/2/9 下午4:19
# @Author: Casually
# @File: args.py
# @Email: fjkl@vip.qq.com
# @Software: PyCharm
import argparse

Prefecture = {
    "冀": {"A": ["河北省", "石家庄市"], "B": ["河北省", "唐山市"], "C": ["河北省", "秦皇岛市"], "D": ["河北省", "邯郸市"], "E": ["河北省", "邢台市"],
          "F": ["河北省", "保定市"], "G": ["河北省", "张家口市"], "H": ["河北省", "承德市"], "J": ["河北省", "沧州市"], "R": ["河北省", "廊坊市"],
          "S": ["河北省", "沧州市"], "T": ["河北省", "衡水市"]},
    "辽": {"A": ["辽宁省", "沈阳市"], "B": ["辽宁省", "大连市"], "C": ["辽宁省", "鞍山市"], "D": ["辽宁省", "抚顺市"], "E": ["辽宁省", "本溪市"],
          "F": ["辽宁省", "丹东市"], "G": ["辽宁省", "锦州市"], "H": ["辽宁省", "营口市"], "J": ["辽宁省", "阜新市"], "K": ["辽宁省", "辽阳市"],
          "L": ["辽宁省", "盘锦市"], "M": ["辽宁省", "铁岭市"], "N": ["辽宁省", "朝阳市"], "P": ["辽宁省", "葫芦岛市"]},
    "皖": {"A": ["安徽省", "合肥市"], "B": ["安徽省", "芜湖市"], "C": ["安徽省", "蚌埠市"], "D": ["安徽省", "淮南市"], "E": ["安徽省", "马鞍山市"],
          "F": ["安徽省", "淮北市"], "G": ["安徽省", "铜陵市"], "H": ["安徽省", "安庆市"], "J": ["安徽省", "黄山市"], "K": ["安徽省", "阜阳市"],
          "L": ["安徽省", "宿州市"], "M": ["安徽省", "滁州市"], "N": ["安徽省", "六安市"], "P": ["安徽省", "宣城市"], "Q": ["安徽省", "巢湖市"],
          "R": ["安徽省", "池州市"], "S": ["安徽省", "亳州市"]},
    "苏": {"A": ["江苏省", "南京市"], "B": ["江苏省", "无锡市"], "C": ["江苏省", "徐州市"], "D": ["江苏省", "常州市"], "E": ["江苏省", "苏州市"],
          "F": ["江苏省", "南通市"], "G": ["江苏省", "连云港市"], "H": ["江苏省", "淮安市"], "J": ["江苏省", "盐城市"], "K": ["江苏省", "扬州市"],
          "L": ["江苏省", "镇江市"], "M": ["江苏省", "泰州市"], "N": ["江苏省", "宿迁市"]},
    "鄂": {"A": ["湖北省", "武汉市"], "B": ["湖北省", "黄石市"], "C": ["湖北省", "十堰市"], "D": ["湖北省", "荆州市"], "E": ["湖北省", "宜昌市"],
          "F": ["湖北省", "襄樊市"], "G": ["湖北省", "鄂州市"], "H": ["湖北省", "荆门市"], "J": ["湖北省", "黄冈市"], "K": ["湖北省", "孝感市"],
          "L": ["湖北省", "咸宁市"], "M": ["湖北省", "仙桃市"], "N": ["湖北省", "潜江市"], "P": ["湖北省", "神农架林区"],
          "Q": ["湖北省", "恩施土家族苗族自治州"], "R": ["湖北省", "天门市"], "S": ["湖北省", "随州市"]},
    "晋": {"A": ["山西省", "太原市"], "B": ["山西省", "大同市"], "C": ["山西省", "阳泉市"], "D": ["山西省", "长治市"], "E": ["山西省", "晋城市"],
          "F": ["山西省", "朔州市"], "H": ["山西省", "忻州市"], "J": ["山西省", "吕梁市"], "K": ["山西省", "晋中市"], "L": ["山西省", "临汾市"],
          "M": ["山西省", "运城市"]},
    "吉": {"A": ["吉林省", "长春市"], "B": ["吉林省", "吉林市"], "C": ["吉林省", "四平市"], "D": ["吉林省", "辽源市"], "E": ["吉林省", "通化市"],
          "F": ["吉林省", "白山市"], "G": ["吉林省", "白城市"], "H": ["吉林省", "延边朝鲜族自治州"], "J": ["吉林省", "松原市"],
          "K": ["吉林省", "长白朝鲜族自治县"]},
    "粤": {"A": ["广东省", "广州市"], "B": ["广东省", "深圳市"], "C": ["广东省", "珠海市"], "D": ["广东省", "汕头市"], "E": ["广东省", "佛山市"],
          "F": ["广东省", "韶关市"], "G": ["广东省", "湛江市"], "H": ["广东省", "肇庆市"], "J": ["广东省", "江门市"], "K": ["广东省", "茂名市"],
          "L": ["广东省", "惠州市"], "M": ["广东省", "梅州市"], "N": ["广东省", "汕尾市"], "P": ["广东省", "河源市"], "Q": ["广东省", "阳江市"],
          "R": ["广东省", "清远市"], "S": ["广东省", "东莞市"], "T": ["广东省", "中山市"], "U": ["广东省", "潮州市"], "V": ["广东省", "揭阳市"],
          "W": ["广东省", "云浮市"], "X": ["广东省", "顺德区"], "Y": ["广东省", "南海区"], "Z": ["广东省", "港澳进入内地车辆"]},
    "藏": {"A": ["西藏自治区", "拉萨市"], "B": ["西藏自治区", "昌都地区"], "C": ["西藏自治区", "山南地区"], "D": ["西藏自治区", "日喀则地区"],
          "E": ["西藏自治区", "那曲地区"], "F": ["西藏自治区", "阿里地区"], "G": ["西藏自治区", "林芝地区"], "H": ["西藏自治区", "驻四川省天全县车辆管理所"],
          "J": ["西藏自治区", "驻青海省格尔木市车辆管理所"]},
    "渝": {"A": ["重庆市"], "B": ["重庆市"], "C": ["重庆市"], "F": ["重庆市"], "G": ["重庆市"], "H": ["重庆市"]},
    "沪": {"A": ["上海市"], "B": ["上海市"], "C": ["上海市"], "D": ["上海市"], "R": ["上海市"]},
    "豫": {"A": ["河南省", "郑州市"], "B": ["河南省", "开封市"], "C": ["河南省", "洛阳市"], "D": ["河南省", "平顶山市"], "E": ["河南省", "安阳市"],
          "F": ["河南省", "鹤壁市"], "G": ["河南省", "新乡市"], "H": ["河南省", "焦作市"], "J": ["河南省", "濮阳市"], "K": ["河南省", "许昌市"],
          "L": ["河南省", "漯河市"], "M": ["河南省", "三门峡市"], "N": ["河南省", "商丘市"], "P": ["河南省", "周口市"], "Q": ["河南省", "驻马店市"],
          "R": ["河南省", "南阳市"], "S": ["河南省", "信阳市"], "U": ["河南省", "济源市"]},
    "黑": {"A": ["黑龙江省", "哈尔滨市"], "B": ["黑龙江省", "齐齐哈尔市"], "C": ["黑龙江省", "牡丹江市"], "D": ["黑龙江省", "佳木斯市"],
          "E": ["黑龙江省", "大庆市"], "F": ["黑龙江省", "伊春市"], "G": ["黑龙江省", "鸡西市"], "H": ["黑龙江省", "鹤岗市"], "J": ["黑龙江省", "双鸭山市"],
          "K": ["黑龙江省", "七台河市"], "L": ["黑龙江省", "松花江地区（已并入哈尔滨市，车牌未改）"], "M": ["黑龙江省", "绥化市"], "N": ["黑龙江省", "黑河市"],
          "P": ["黑龙江省", "大兴安岭地区"], "R": ["黑龙江省", "农垦系统"]},
    "鲁": {"A": ["山东省", "济南市"], "B": ["山东省", "青岛市"], "C": ["山东省", "淄博市"], "D": ["山东省", "枣庄市"], "E": ["山东省", "东营市"],
          "F": ["山东省", "烟台市"], "G": ["山东省", "潍坊市"], "H": ["山东省", "济宁市"], "J": ["山东省", "泰安市"], "K": ["山东省", "威海市"],
          "L": ["山东省", "日照市"], "M": ["山东省", "滨州市"], "N": ["山东省", "德州市"], "P": ["山东省", "聊城市"], "Q": ["山东省", "临沂市"],
          "R": ["山东省", "菏泽市"], "S": ["山东省", "莱芜市"], "U": ["山东省", "青岛市"], "V": ["山东省", "潍坊市"], "Y": ["山东省", "烟台市"]},
    "浙": {"A": ["浙江省", "杭州市"], "B": ["浙江省", "宁波市"], "C": ["浙江省", "温州市"], "D": ["浙江省", "绍兴市"], "E": ["浙江省", "湖州市"],
          "F": ["浙江省", "嘉兴市"], "G": ["浙江省", "金华市"], "H": ["浙江省", "衢州市"], "J": ["浙江省", "台州市"], "K": ["浙江省", "丽水市"],
          "L": ["浙江省", "舟山市"]},
    "桂": {"A": ["广西省", "南宁市"], "B": ["广西省", "柳州市"], "C": ["广西省", "桂林市"], "D": ["广西省", "梧州市"], "E": ["广西省", "北海市"],
          "F": ["广西省", "崇左市"], "G": ["广西省", "来宾市"], "H": ["广西省", "桂林市"], "J": ["广西省", "贺州市"], "K": ["广西省", "玉林市"],
          "M": ["广西省", "河池市"], "N": ["广西省", "钦州市"], "P": ["广西省", "防城港市"], "R": ["广西省", "贵港市"]},
    "蒙": {"A": ["内蒙古自治区", "呼和浩特市"], "B": ["内蒙古自治区", "包头市"], "C": ["内蒙古自治区", "乌海市"], "D": ["内蒙古自治区", "赤峰市"],
          "E": ["内蒙古自治区", "呼伦贝尔市"], "F": ["内蒙古自治区", "兴安盟"], "G": ["内蒙古自治区", "通辽市"], "H": ["内蒙古自治区", "锡林郭勒盟"],
          "J": ["内蒙古自治区", "乌兰察布市"], "K": ["内蒙古自治区", "鄂尔多斯市"], "L": ["内蒙古自治区", "巴彦淖尔市"], "M": ["内蒙古自治区", "阿拉善盟"]},
    "闽": {"A": ["福建省", "福州市"], "B": ["福建省", "莆田市"], "C": ["福建省", "泉州市"], "D": ["福建省", "厦门市"], "E": ["福建省", "漳州市"],
          "F": ["福建省", "龙岩市"], "G": ["福建省", "三明市"], "H": ["福建省", "南平市"], "J": ["福建省", "宁德市"], "K": ["福建省", "省直系统"]},
    "川": {"A": ["四川省", "成都市"], "B": ["四川省", "绵阳市"], "C": ["四川省", "自贡市"], "D": ["四川省", "攀枝花市"], "E": ["四川省", "泸州市"],
          "F": ["四川省", "德阳市"], "H": ["四川省", "广元市"], "J": ["四川省", "遂宁市"], "K": ["四川省", "内江市"], "L": ["四川省", "乐山市"],
          "M": ["四川省", "资阳市"], "Q": ["四川省", "宜宾市"], "R": ["四川省", "南充市"], "S": ["四川省", "达州市"], "T": ["四川省", "雅安市"],
          "U": ["四川省", "阿坝藏族羌族自治州"], "V": ["四川省", "甘孜藏族自治州"], "W": ["四川省", "凉山彝族自治州"], "X": ["四川省", "广安市"],
          "Y": ["四川省", "巴中市"], "Z": ["四川省", "眉山市"]},
    "琼": {"A": ["海南省", "海口市"], "B": ["海南省", "三亚市"], "C": ["海南省", "琼海市"], "D": ["海南省", "五指山市"], "E": ["海南省", "洋浦开发区"]},
    "京": {"A": ["北京市"], "B": ["北京市"], "C": ["北京市"], "D": ["北京市"], "E": ["北京市"], "F": ["北京市"], "G": ["北京市"],
          "H": ["北京市"], "J": ["北京市"], "K": ["北京市"], "L": ["北京市"], "M": ["北京市"], "N": ["北京市"], "P": ["北京市"],
          "Q": ["北京市"]},
    "云": {"A": ["云南省", "昆明市"], "C": ["云南省", "昭通市"], "D": ["云南省", "曲靖市"], "E": ["云南省", "楚雄彝族自治州"], "F": ["云南省", "玉溪市"],
          "G": ["云南省", "红河哈尼族彝族自治州"], "H": ["云南省", "文山壮族苗族自治州"], "J": ["云南省", "思茅区"], "K": ["云南省", "西双版纳傣族自治州"],
          "L": ["云南省", "大理白族自治州"], "M": ["云南省", "保山市"], "N": ["云南省", "德宏傣族景颇族自治州"], "P": ["云南省", "丽江市"],
          "Q": ["云南省", "怒江傈僳族自治州"], "R": ["云南省", "迪庆藏族自治州"], "S": ["云南省", "临沧市"]},
    "湘": {"A": ["湖南省", "长沙市"], "B": ["湖南省", "株洲市"], "C": ["湖南省", "湘潭市"], "D": ["湖南省", "衡阳市"], "E": ["湖南省", "邵阳市"],
          "F": ["湖南省", "岳阳市"], "G": ["湖南省", "张家界市"], "H": ["湖南省", "益阳市"], "J": ["湖南省", "常德市"], "K": ["湖南省", "娄底市"],
          "L": ["湖南省", "郴州市"], "M": ["湖南省", "永州市"], "N": ["湖南省", "怀化市"], "U": ["湖南省", "湘西土家族苗族自治州"]},
    "新": {"A": ["新疆维吾尔自治区", "乌鲁木齐市"], "B": ["新疆维吾尔自治区", "昌吉回族自治州"], "C": ["新疆维吾尔自治区", "石河子市"], "D": ["新疆维吾尔自治区", "奎屯市"],
          "E": ["新疆维吾尔自治区", "博尔塔拉蒙古自治州"], "F": ["新疆维吾尔自治区", "伊犁哈萨克自治州"], "G": ["新疆维吾尔自治区", "塔城地区"],
          "H": ["新疆维吾尔自治区", "阿勒泰地区"], "J": ["新疆维吾尔自治区", "克拉玛依市"], "K": ["新疆维吾尔自治区", "吐鲁番地区"], "L": ["新疆维吾尔自治区", "哈密地区"],
          "M": ["新疆维吾尔自治区", "巴音郭愣蒙古自治州"], "N": ["新疆维吾尔自治区", "阿克苏地区"], "P": ["新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州"],
          "Q": ["新疆维吾尔自治区", "喀什地区"], "R": ["新疆维吾尔自治区", "和田地区"]},
    "赣": {"A": ["江西省", "南昌市"], "B": ["江西省", "赣州市"], "C": ["江西省", "宜春市"], "D": ["江西省", "吉安市"], "E": ["江西省", "上饶市"],
          "F": ["江西省", "抚州市"], "G": ["江西省", "九江市"], "H": ["江西省", "景德镇市"], "J": ["江西省", "萍乡市"], "K": ["江西省", "新余市"],
          "L": ["江西省", "鹰潭市"], "M": ["江西省", "南昌市"]},
    "甘": {"A": ["甘肃省", "兰州市"], "B": ["甘肃省", "嘉峪关市"], "C": ["甘肃省", "金昌市"], "D": ["甘肃省", "白银市"], "E": ["甘肃省", "天水市"],
          "F": ["甘肃省", "酒泉市"], "G": ["甘肃省", "张掖市"], "H": ["甘肃省", "武威市"], "J": ["甘肃省", "定西市"], "K": ["甘肃省", "陇南市"],
          "L": ["甘肃省", "平凉市"], "M": ["甘肃省", "庆阳市"], "N": ["甘肃省", "临夏回族自治州"], "P": ["甘肃省", "甘南藏族自治州"]},
    "陕": {"A": ["陕西省", "西安市"], "B": ["陕西省", "铜川市"], "C": ["陕西省", "宝鸡市"], "D": ["陕西省", "咸阳市"], "E": ["陕西省", "渭南市"],
          "F": ["陕西省", "汉中市"], "G": ["陕西省", "安康市"], "H": ["陕西省", "商洛市"], "J": ["陕西省", "延安市"], "K": ["陕西省", "榆林市"],
          "V": ["陕西省", "杨凌区"]},
    "贵": {"A": ["贵族省", "贵阳市"], "B": ["贵族省", "六盘水市"], "C": ["贵族省", "遵义市"], "D": ["贵族省", "铜仁地区"],
          "E": ["贵族省", "黔西南布依族苗族自治州"], "F": ["贵族省", "毕节地区"], "G": ["贵族省", "安顺市"], "H": ["贵族省", "黔东南苗族侗族自治州"],
          "J": ["贵族省", "黔南布依族苗族自治州"]},
    "青": {"A": ["青海省", "西宁市"], "B": ["青海省", "海东地区"], "C": ["青海省", "海北藏族自治州"], "D": ["青海省", "黄南藏族自治州"],
          "E": ["青海省", "海南藏族自治州"], "F": ["青海省", "果洛藏族自治州"], "G": ["青海省", "玉树藏族自治州"], "H": ["青海省", "海西蒙古族藏族自治州"]},
    "宁": {"A": ["宁夏回族自治区", "银川市"], "B": ["宁夏回族自治区", "石嘴山市"], "C": ["宁夏回族自治区", "银南市"], "D": ["宁夏回族自治区", "固原市"],
          "E": ["宁夏回族自治区", "中卫市"]},
    "津": {"A": ["天津市"], "B": ["天津市"], "C": ["天津市"], "D": ["天津市"], "E": ["天津市"], "F": ["天津市"], "G": ["天津市"],
          "H": ["天津市"]}}
provinces = ["zh_cuan", "川", "zh_e", "鄂", "zh_gan", "赣", "zh_gan1", "甘", "zh_gui", "贵", "zh_gui1", "桂", "zh_hei", "黑",
             "zh_hu", "沪", "zh_ji", "冀", "zh_jin", "津", "zh_jing", "京", "zh_jl", "吉", "zh_liao", "辽", "zh_lu", "鲁",
             "zh_meng", "蒙", "zh_min", "闽", "zh_ning", "宁", "zh_qing", "靑", "zh_qiong", "琼", "zh_shan", "陕", "zh_su",
             "苏", "zh_sx", "晋", "zh_wan", "皖", "zh_xiang", "湘", "zh_xin", "新", "zh_yu", "豫", "zh_yu1", "渝", "zh_yue",
             "粤", "zh_yun", "云", "zh_zang", "藏", "zh_zhe", "浙"]
cardtype = {"blue": "蓝色牌照",
            "green": "绿色牌照",
            "yellow": "黄色牌照"}
pic_size = {'open': 1,
            'blur': 3,
            'morphologyr': 4,
            'morphologyc': 19,
            'col_num_limit': 10,
            'row_num_limit': 21
            }

# 创建参数的解析对象
parser = argparse.ArgumentParser(description='PyTorch garbage Training ')

# 参数列表
parser.add_argument('--Size', default=20, type=int, metavar='SZ', help='学图片长宽')
parser.add_argument('--MAX_WIDTH', default=1000, type=int, metavar='MAX', help='原始图片最大宽度')
parser.add_argument('--Min_Area', default=2000, type=int, metavar='Min', help='车牌区域允许最大面积')
parser.add_argument('--PROVINCE_START', default=1000, type=int, metavar='START', help='省份字符开始位置')
parser.add_argument('--provinces', default=provinces, help='标签对应字符')
parser.add_argument('--cardtype', default=cardtype, help='标签对应车牌类型')
parser.add_argument('--Prefecture', default=Prefecture, help='省份字符开始位置')
parser.add_argument('--Pic_size', default=pic_size, help='')

# 解析参数
args = parser.parse_args()
